## 1. import, seed, print option 세팅

In [2]:
import numpy as np
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
import numpy as np
np.random.seed(12345)

import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
PREVIOUS_MAX_ROWS               = pd.options.display.max_rows
# 출력시 최대행수, 최대열수, 각 열의 최대너비
pd.options.display.max_rows     = 20
pd.options.display.max_columns  = 20
pd.options.display.max_colwidth = 80
# NumPy 배열의 출력 옵션을 설정
# 소수점 이하 4자리까지 표시, 작은 숫자는 지수 형태로 표시하지 않음.
np.set_printoptions(precision=4, suppress=True)

# 5.1 판다스 자료구조 소개

배열과 판다스의 차이 : 배열은 데이터만 들어있지만, 판다스에는 각행을 지칭하는 인덱스와, 각 열을 지칭하는 피쳐가 존재

## 2. Series 생성

In [30]:
obj = Series([4, 7, -5, 3])

In [31]:
# 기본 인덱스는 정수 인덱스
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [32]:
obj2 = Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [33]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [34]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
obj.dtype

dtype('int64')

In [36]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [37]:
# 6p
personal_info = Series(['박서윤', 170.6, 26], index=['name', 'height', 'age'])
personal_info

name        박서윤
height    170.6
age          26
dtype: object

## 3. Series 호출

In [38]:
obj2["d"]

4

In [39]:
obj2["d"] = 6
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [40]:
# 슬라이싱 순서로 호출도 가능
# 하지만 슬라이싱시 인덱스로도 가능하고, 순서로도 가능 - 복잡
obj2[0:2]

d    6
b    7
dtype: int64

## 4. Series 연산

In [41]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [42]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [43]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [44]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [45]:
np.isin(obj2,[6,7])

array([ True,  True, False, False])

In [46]:
"b" in obj2

True

In [47]:
"e" in obj2

False

In [48]:
# 7p
personal_info = Series(['박서윤', 170.4, 26], index=['name', 'height', 'age'])
personal_info["age"] += 10
print(personal_info)
# 인덱스 호출시 []사용과 속성불러오는 방법이 있음!
print(personal_info[["height", "name"]])
personal_info.height

name        박서윤
height    170.4
age          36
dtype: object
height    170.4
name        박서윤
dtype: object

170.4

## 5. 딕셔너리와의 관계

In [49]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
# Dict to Series
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [50]:
# Series to Dict
print(obj3.to_dict())
obj3

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [51]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [52]:
# 8p
personal_info = Series(['박서윤', 170.4, 26], index=['name', 'height', 'age'])
personal_info =personal_info.to_dict()
print(personal_info)

personal_info2 = Series(personal_info, index=['name'])
personal_info2

{'name': '박서윤', 'height': 170.4, 'age': 26}

name    박서윤
dtype: object

## 6. 결측치 확인

In [53]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [54]:
np.isnan(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [55]:
np.isinf(obj4)

California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [56]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [57]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [58]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

## 7. 산술 연산 시에 색인과 레이블 자동정렬

In [59]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [60]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [61]:
# 데이터가 누락된 경우 NaN으로 처리
# 인덱스(색인)은 자동정렬
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

## 8. name 속성, 인덱싱, 데이터 추가, 교체

In [62]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [63]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

### 데이터 추가, 교체

In [64]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [65]:
obj["Stella"]=10
obj

Bob        4
Steve      7
Jeff      -5
Ryan       3
Stella    10
dtype: int64

In [66]:
del obj['Stella']

In [67]:
obj.pop("Steve")

7

In [68]:
obj

Bob     4
Jeff   -5
Ryan    3
dtype: int64

In [69]:
# 10p
personal_info = Series(['박서윤', 170.4, 26], index=['name', 'height', 'age'])
del personal_info['name']
personal_info['gender'] = 'Female'
personal_info.index     = ['h', 'a', 'g']
personal_info

h     170.4
a        26
g    Female
dtype: object

## 9. 데이터 프레임 생성

In [128]:
data = {
        "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        }
frame = DataFrame(data)

In [129]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### head, tail

In [130]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [131]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### 피쳐 선택적으로 생성

In [132]:
DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

### 없는 피쳐 선택하면, 결측치로 생성됨

In [133]:
frame2 = DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

### 피쳐 확인, 피쳐별 데이터 호출

In [134]:
# 피쳐 전체 확인
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [135]:
# 피쳐 선택 확인 - 괄호 인덱싱
print(frame2["state"])

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [136]:
# 피쳐 선택 확인 - 속성 (점 표기법)
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

### 특정 피쳐 데이터는 Series객체이다.

In [137]:
type(frame2)

pandas.core.frame.DataFrame

In [138]:
# 특정 피쳐만 호출된 데이터는 Series 객체
type(frame2.year)

pandas.core.series.Series

## 10. 피쳐 추가

In [139]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [140]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [141]:
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [142]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

### index는 immutable

In [143]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [144]:
# index는 수정 불가능
frame.index[0]=8

TypeError: Index does not support mutable operations

In [145]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [146]:
# 쌍이 다 깨져버림
frame.index = [5,4,3,2,1,0]

In [147]:
frame

    state  year  pop
5    Ohio  2000  1.5
4    Ohio  2001  1.7
3    Ohio  2002  3.6
2  Nevada  2001  2.4
1  Nevada  2002  2.9
0  Nevada  2003  3.2

In [148]:
frame.index = [0,1,2,3,4,5]

In [ ]:
val = Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
frame2["debt"] = val
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [ ]:
val = Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

### 피쳐 삭제

In [ ]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
frame2.pop("debt")

0    NaN
1    NaN
2   -1.2
3    NaN
4   -1.5
5   -1.7
Name: debt, dtype: float64

In [ ]:
frame2

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

### drop은 뒤에 더 자세하게 다룸

In [ ]:
# drop은 해당 데이터를 삭제한 새로운 프레임을 반환
# 원본 데이터는 변경 x
frame2.drop(columns=["year"])

    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9
5  Nevada  3.2

In [ ]:
frame2

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [26]:
frame2.drop(index=4)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
5  2003  Nevada  3.2

## 11. 중첩된 dictionary를 활용한 DataFrame 생성

### 동일한 길이로 값이 이루어진 딕셔너리 -> DF

In [94]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [95]:
DataFrame(data)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### 딕셔너리 리스트 ->DF

In [92]:
data1={"state": "Ohio", 
        "year": 2000,
        "pop": 1.5}

data2={"state": "Mass", 
        "year": 2000,
        "GDP": 1.8}

data3={"year": 2011,
        "pop": 1.1}

In [93]:
DataFrame([data1,data2,data3])

  state  year  pop  GDP
0  Ohio  2000  1.5  NaN
1  Mass  2000  NaN  1.8
2   NaN  2011  1.1  NaN

### 중첩된 딕셔너리 ->DF

In [96]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
            "Nevada": {2001: 2.4, 2002: 2.9}}

In [97]:
frame3 = DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [98]:
DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [99]:
pdata = {"Ohio": frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

### 2차원 넘파이 배열 -> DF

In [100]:
arr=np.array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.2]])
D=DataFrame(arr)
D

      0       1    2
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [101]:
D.index=['a','b','c','d','e','f']

In [102]:
D.columns=['year','state','pop']

In [103]:
D

   year   state  pop
a  2000    Ohio  1.5
b  2001    Ohio  1.7
c  2002    Ohio  3.6
d  2001  Nevada  2.4
e  2002  Nevada  2.9
f  2003  Nevada  3.2

In [104]:
arr=np.array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.2]])
D=DataFrame(arr,index=['a','b','c','d','e','f'],columns=['year','state','pop'])
D

   year   state  pop
a  2000    Ohio  1.5
b  2001    Ohio  1.7
c  2002    Ohio  3.6
d  2001  Nevada  2.4
e  2002  Nevada  2.9
f  2003  Nevada  3.2

## 12. name 속성

In [105]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [106]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [107]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

# 5.2 핵심기능

## 13. reindex (재색인)

In [149]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [150]:
obj.index=['a','b','c','d']

In [151]:
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

### 기존 색인-피쳐 관계를 유지

In [154]:
# obj.reindex 는 원본 객체에 영향 x
obj2=obj.reindex(["a", "c", "d", "b", "e"])
obj2

a    4.5
c   -5.3
d    3.6
b    7.2
e    NaN
dtype: float64

In [155]:
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

In [156]:
obj3 = Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [157]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [158]:
# method=ffill: 결측치 발생 시, 이전 색인의 값으로 대체
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [160]:
# method=bfill: 결측치 발생 시, 이후 색인의 값으로 대체
obj3.reindex(np.arange(6), method="bfill")

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [159]:
# fill_value: 결측치 발생 시, 대체할 값을 지정
obj3.reindex(np.arange(6), fill_value=777)

0      blue
1       777
2    purple
3       777
4    yellow
5       777
dtype: object

### DF에서의 재색인

### DF 거의 대부분의 메서드에서  axis="columns" 와 axis="index" 적용이 가능 (각각 1 혹은 0도 적용가능)

In [163]:
frame = DataFrame(np.arange(9).reshape((3, 3)),
                    index=["a", "c", "d"],
                    columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [164]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [165]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [166]:
# 위와 같은 역할이지만 표현이 다름
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [167]:
frame.reindex(states, axis=1)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [173]:
# frame.reindex(states, axis=0)
frame.reindex(states, axis='index')

            Ohio  Texas  California
Texas        NaN    NaN         NaN
Utah         NaN    NaN         NaN
California   NaN    NaN         NaN

In [170]:
# DataFrame.loc[row_label, column_label]
frame.loc[['a','d','c'],['California','Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

In [672]:
# 없는 인덱스, 컬럼이면 오류
frame.loc[['a','d','c'],['California','Texas','Utah']]

KeyError: "['Utah'] not in index"

In [5]:
# 17p
personal_info = Series(['박서윤',170.6,26], index=['name','height','age'])
print(personal_info)
personal_info_fr = personal_info.reindex(['height','age','gender'], fill_value='female')
personal_info_fr

name        박서윤
height    170.6
age          26
dtype: object

height     170.6
age           26
gender    female
dtype: object

## 14. 행이나 열 삭제하기 (drop)

In [673]:
obj = Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [674]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [675]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [676]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

### DataFrame에서 drop

### index나 columns를 선택적으로 drop 가능

In [679]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [680]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [681]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [682]:
data.drop(["two", "four"], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [683]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 15. Series 색인

### 넘파이 배열처럼 괄호를 통해서 색인 가능

### 괄호 index 순서나 index 레이블을 입력하여 호출

In [690]:
obj = Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [691]:
obj[:2][1]

1.0

In [692]:
obj["b"]

1.0

In [693]:
obj[1]

1.0

In [695]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [696]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [697]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [698]:
obj < 2

a     True
b     True
c    False
d    False
dtype: bool

In [699]:
type(obj<2)

pandas.core.series.Series

In [700]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

### loc과 iloc

In [707]:
obj

3    0.0
2    1.0
1    2.0
0    3.0
dtype: float64

In [708]:
obj.loc[3]

0.0

In [709]:
obj.iloc[3]

3.0

In [710]:
obj.loc[obj<2]

3    0.0
2    1.0
dtype: float64

In [711]:
obj.iloc[obj<2]

NotImplementedError: iLocation based boolean indexing on an integer type is not available

## 16. DataFrame 색인

### 기본 색인 방법

In [723]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [724]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [725]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [726]:
data[1:2]

          one  two  three  four
Colorado    4    5      6     7

In [727]:
data[[1,2]]

KeyError: "None of [Int64Index([1, 2], dtype='int64')] are in the [columns]"

In [728]:
data[2]

KeyError: 2

In [729]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [730]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [731]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [732]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
type(data['three'] < 5)
data['three']

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [366]:
data['three'] < 5

Ohio         True
Colorado    False
Utah        False
New York    False
Name: three, dtype: bool

In [733]:
data[data['three'] < 5]

      one  two  three  four
Ohio    0    1      2     3

In [734]:
data[data['three'] < 5] = 0

In [735]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### DataFrame의 loc, iloc 속성

### loc과 iloc 적용시 넘파이 배열의 색인과 동일

In [741]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [742]:
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [743]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [744]:
data.loc[["Colorado", "New York"], ["two", "three"]]

          two  three
Colorado    5      6
New York   13     14

In [745]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [746]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [754]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    4    5      6     7

In [753]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [402]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [403]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

#### 레이블의 슬라이싱은 레이블도 포함

In [405]:
data.loc[:"Utah", "two"]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [406]:
data.iloc[:, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [414]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [411]:
type(data.three >= 2)

pandas.core.series.Series

In [412]:
data.three >= 2

Ohio        True
Colorado    True
Utah        True
New York    True
Name: three, dtype: bool

In [757]:
data.loc[data.three >= 8]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [758]:
data.iloc[data.three >= 2]

ValueError: iLocation based boolean indexing cannot use an indexable as a mask

## 17. 산술연산과 데이터정렬

In [418]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [419]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [420]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [421]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [422]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [423]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [424]:
df1 = DataFrame({"A": [1, 2]})
df2 = DataFrame({"B": [3, 4]})
df1

   A
0  1
1  2

In [425]:
df2

   B
0  3
1  4

In [426]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [427]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df2.loc[1, "b"] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [428]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [429]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [430]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [431]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [432]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [437]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## 19. DataFrame과 Series 간의 연산

In [763]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [764]:
arr[0]

array([0., 1., 2., 3.])

In [765]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [766]:
frame = DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

In [767]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [768]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [769]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [770]:
series2 = Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [771]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [772]:
series3 = frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [773]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [774]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [775]:
frame.sub(series,axis="index")

         b   d   e
Ohio   NaN NaN NaN
Oregon NaN NaN NaN
Texas  NaN NaN NaN
Utah   NaN NaN NaN
b      NaN NaN NaN
d      NaN NaN NaN
e      NaN NaN NaN

In [776]:
frame.sub(series,axis="columns")

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [777]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## 20. 함수 적용과 맵핑

In [474]:
frame = DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [475]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [476]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [478]:
frame.apply(lambda x:x.max()-x.min())

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [480]:
frame.apply(f1,axis="index")

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [479]:
frame.apply(f1, axis="columns")

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [778]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [484]:
def f2(x):
    return Series([x.min(), x.max()], index=["min", "max"])
type(frame.apply(f2))
frame.apply(f2)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

## 21. 정렬과 순위

### sort_index

In [485]:
obj = Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [486]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [487]:
frame = DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [488]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [489]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [490]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### sort_values

In [491]:
obj = Series([4, 7, -3, 2])

In [492]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [493]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [495]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

### DataFrame의 sort_values

In [496]:
frame = DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [497]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [498]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### rank

In [499]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [500]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [501]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [502]:
frame = DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [503]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## 22. 중복색인

In [504]:
obj = Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

### index.is_unique

In [505]:
obj.index.is_unique

False

In [507]:
obj["a"]

a    0
a    1
dtype: int32

In [508]:
obj["c"]

4

In [509]:
df = DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228
c -0.577087  0.124121  0.302614

In [510]:
df.loc["b"]

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [511]:
df.loc["c"]

0   -0.577087
1    0.124121
2    0.302614
Name: c, dtype: float64

## 23. 넘파이 기반 함수/메서드 제공

In [781]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [782]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [787]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [788]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [789]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [790]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [791]:
df.idxmax()

one    b
two    d
dtype: object

In [792]:
df.idxmax(axis="columns")

a    one
b    one
c    NaN
d    one
dtype: object

In [793]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [794]:
df.cumsum(axis=0)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [795]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [796]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [797]:
obj = Series(["a", "a", "b", "c"] * 4)

In [798]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [799]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 24. 상관관계와 공분산

In [800]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [801]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [802]:
type(price)

pandas.core.frame.DataFrame

In [803]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [558]:
returns = price.pct_change()

In [559]:
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [560]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [561]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [562]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [563]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [564]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [565]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [566]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

## 25. 유일값, 값세기 관련 메서드

###  유일한 원소만 남기기

In [820]:
obj = Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [821]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

### 도수 나타내기

In [822]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [823]:
pd.value_counts(obj, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [824]:
obj
mask = obj.isin(["b", "c"])
mask
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### Index.get_indexer메소드

In [829]:
pd.Index(uniques).get_indexer(obj)

array([0, 1, 2, 1, 1, 3, 3, 0, 0], dtype=int64)

### 데이터프레임 히스토그램

In [817]:
data = DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [818]:
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [819]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0